---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionZ
source: html/73feeafa-ff8e-653e-faab-9441738c3cb4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryDirectionZ Property

"Z Translation"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryDirectionZ { get; }
```